backend: "python"

input [
  {
    name: "INPUT0"
    data_type: TYPE_FP32
    dims: [-1, -1, -1 ]
  },
  {
    name: "INPUT1"
    data_type: TYPE_INT32
    dims: [1]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [ 1, -1, -1, -1 ]
  },
  {
    name: "OUTPUT1"
    data_type: TYPE_FP32
    dims: [ -1, -1, 2 ]
  }
]

instance_group [
  {
    count: 2
  }
]