platform: "ensemble"

input [
  {
    name: "input1"
    data_type: TYPE_INT32
    dims: [1]
  },
  {
    name: "input0"
    data_type: TYPE_FP32
    dims: [ -1, -1, -1 ]
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ -1]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: 1
      input_map {
        key: "INPUT0"
        value: "input0"
      },
      input_map {
        key: "INPUT1"
        value: "input1"
      }
      output_map {
        key: "OUTPUT0"
        value: "preprocess_image"
      },
      output_map {
        key: "OUTPUT1"
        value: "ycbcr"
      }
    },
    {
      model_name: "ECBSR"
      model_version: 1
      input_map {
        key: "input"
        value: "preprocess_image"
      }
      output_map {
        key: "output"
        value: "postprocess_image"
      }
    },
    {
      model_name: "postprocess"
      model_version: 1
      input_map {
        key: "INPUT0"
        value: "postprocess_image"
      }
      input_map {
        key: "INPUT1"
        value: "ycbcr"
      }
      output_map {
        key: "OUTPUT0"
        value: "output"
      }
    }
  ]
}